Repository: Otabek-Rizayev/Ariza_bot
Catalog: locales/*/LC_MESSAGES/lang.po
Languages: ru

source: 🔙 Orqaga
ru: 🔙 Назад

source: 💬 Adminga xabar qoldirish
ru: 💬 Оставьте сообщение администратору

source: 📝 Ariza qoldirish
ru: 📝 Оставьте заявку

source: 👤 Biz haqimizda
ru: 👤 О нас

source: Meneger
ru: Менеджер

source: Buxgalter
ru: Бухгалтер

source: Injiner
ru: Инженер

source: Loyiha boshqaruvchisi
ru: Руководитель проекта

source: Salom <b>{user}</b>
ru: Здравствуйте <b>{user}</b>

source: Til o'zgardi ✅
ru: Язык изменен ✅

source: Boshlash uchun /start bosing
ru: Нажмите /start, чтобы начать

source: Adminga o'z fikr mulohazalaringizni yuboring. Albatta iltimosingiz ko'rib chiqiladi!
ru: Отправить отзыв администратору. Конечно, ваша просьба будет рассмотрена!

source: Bosh sahifa
ru: Домашняя страница

source: Fikr mulohazangiz uchun tashakkur!
ru: Спасибо за ваш отзыв!

source: Ish turini tanlang:
ru: Выберите тип работы:

source: Knopkadan tanlang!
ru: Выберите с помощью кнопки

source: Ism, familiyangizni kiriting:
ru: Введите свое имя и фамилию:

source: Ariza bekor qilindi!
ru: Заявка отменена!

source: Oldingi ish-faoliyatingiz haqida qisqacha yozing:
ru: Кратко опишите свою предыдущую работу:

source: Telefon raqamingizni to'liq kiriting: Misol uchun: +9989********
ru: Введите свой полный номер телефона: Например: +9989 ********

source: Telefon raqam noto'g'ri kiritildi!
ru: Номер телефона введен неверно!

source: ✅ Arizangiz qabul qilindi. Tez orada aloqaga chiqiladi.
ru: ✅ Ваша заявка принята. Скоро свяжемся.
