Repository: Otabek-Rizayev/Ariza_bot
Catalog: locales/*/LC_MESSAGES/tkmbot.po
Languages: ru, uz

source: 🔙 Back
ru: 🔙 Назад
uz: 🔙 Орқага

source: 📝 Leave an application
ru: 📝 Оставьте заявку
uz: 📝 Ариза қолдириш

source: ✅ Types of services
ru: ✅ Виды услуг
uz: ✅ Хизмат турлари

source: 👤 About us
ru: 👤 О нас
uz: 👤 Биз ҳақимизда

source: Export assistance
ru: Продвижение экспорта
uz: Экспортга кўмаклашиш

source: Exhibition
ru: Выставки
uz: Кўргазма

source: Preparation of a business plan
ru: Бизнес-план
uz: Бизнес режа тайёрлаш

source: Legal issues
ru: Юридические проблемы
uz: Юридик масалалар

source: Welcome to the bot Official of the Tashkent Regional Department of the Chamber of Commerce and Industry
ru: Добро пожаловать в Ташкентское региональное отделение Торгово-промышленной палаты
uz: Савдо-Саноат палатаси Тошкент вилояти Худудий бошқармасининг расмий ботига хуш келибсиз

source: Your language: <i>{language}</i>
ru: Ваш язык: <i>{language}</i>
uz: Сизнинг тилингиз: <i>{language}</i>

source: Language adjusted ✅
uz: Тил созланди ✅

source: Click restart /start
uz: Qayta boshlash /start

source: Select the type of work:
ru: Выберите тип работы:
uz: Иш турини танланг:

source: Home page
ru: Домашняя страница
uz: Бош саҳифа

source: Choose from the buttons!
ru: Выберите с кнопки!
uz: Кнопкадан танланг!

source: Application canceled!
ru: Заявка отменена!
uz: Ариза бекор қилинди!

source: Do you want to leave an application?
ru: Хотите оставить заявку?
uz: Ариза қолдиришни истайсизми?

source: Enter your name:
ru: Введите ваше имя:
uz: Исмингизни киритинг:

source: Enter the full name of your company:
ru: Введите полное название вашей компании:
uz: Фирмангизни тўлик номини киритинг:

source: Enter the (STIR)INN number:
ru: Введите (STIR)ИНН:
uz: (STIR)ИНН рақамини киритинг:

source: (STIR)INN number entered incorrectly!
ru: (STIR)ИНН введен неверно!
uz: (STIR)ИНН рақами нотўғри киритилди!

source: Enter your full phone number: For example: +9989********
ru: Введите свой полный номер телефона:Например: +9989********
uz: Телефон рақамингизни тўлиқ киритинг: Мисол учун: +9989********

source: Phone number entered incorrectly! Please enter the full number
ru: Номер телефона введен неправильно! Пожалуйста, введите полный номер
uz: Телефон рақами нотўғри киритилди! Илтимос рақамни тўлиқ киритинг

source: ✅ Your application has been accepted and will be contacted shortly
ru: ✅ Ваша заявка принята, с вами свяжутся в ближайшее время
uz: ✅ Аризангиз қабул қилинди, тез орада алоқага чиқилади

source: Language adjusted
ru: Язык настроен
