import logging
from aiogram import Bot, Dispatcher, executor, types
from aiogram.dispatcher.filters.state import State, StatesGroup
from aiogram.contrib.fsm_storage.memory import MemoryStorage
from aiogram.dispatcher import FSMContext
import keyboards as kb
API_TOKEN = '5156800116:AAFmF0RALm3ZYCGqHhWsYnnJvJSDXZXEyhM'

logging.basicConfig(level=logging.INFO)

bot = Bot(token=API_TOKEN)
dp = Dispatcher(bot)

#storage = MemoryStorage()
#dp = Dispatcher(bot, storage=storage)

@dp.message_handler(commands=['start'])
async def send_welcome(message: types.Message):
    await message.reply("Савдо-Саноат палатаси Тошкент вилояти Худудий бошқармасига хуш келибсз", reply_markup=kb.mainmenu)


@dp.message_handler()
async def uzb(message: types.Message):
    if message.text == "✅ Xizmat turlari":
        await message.answer("Xizmat turlarini tanlang.", reply_markup=kb.ish)
    if message.text == "🔙 Orqaga":
        await message.reply("Bosh sahifa",reply_markup=kb.mainmenu)
    if message.text == "👤 Biz haqimizda":
        await message.reply("Узбекистон Республикаси Савдо-саноат палатаси Узбекистон Републикаси  Адлия Вазирлигида 1998 йил 28 декабр 353-сон билан руйхатга олинган ва кайта ташкил қилинган\n\n"
                            "Палата куйидаги максадларда тузилади:\n\n"
                            "тадбиркорликни янада ривожлантириш учун кулай шарт-шароит яратиш; бизнес-мухитни такомиллаштириш; республика тадбиркорларининг хорижий хамкорлар билан ишбилармонлик алокаларини мустахкамлаш;\n" 
                            "махаллий товарлар ва хизматларни ташки бозорларга олиб чикиш; тайёр ракобатбардош махсулотлар ишлаб чикарилишини таъминлаш учун янги корхоналарни ташкил этиш, мавжуд ишлаб чикаришларни техник кайта жихозлаш ва замонавийлаштириш учун республикага чет эл сармоясини кенг жалб этиш;\n\n"
                            "Узбекистон Республикаси иктисодий тараккиётига, унинг жахон хужалик тизимига уйгунлашишига, Узбекистон тадбиркорларининг бошка мамлакат тадбиркорлари билан савдо-сотик ва илмий-техник алокаларини Урнатишга кумаклашиш;\n"
                            "Палата аъзоларини бирлаштириш ва куллаб-кувватлаш; тадбиркорлик субъектлари — Палата аъзоларининг манфаатларини ифода этиш ва хукукларини химоя килиш; бозор инфратузилмасининг яхлит тизимини шакллантириш.\n\n"
                            "Тадбиркорларнинг хуқуқларини химоя қилиш сохасида - тадбиркорлик субьектларини, афниқса ўз фаолиятини йўлга кўйиш даврида уларни кўллаб - кувватлашнинг самарали тизимини яратиш, уларнинг хуқуқлари ва конуний манфаатлари ишончли мухофазасининг кафолатларини кучайтириш, жадал ривожланишига хар томонлама кўмак бериш, хусусий мулк ва тадбиркорликнинг устуворлик роли ва дахлсизлигини таъминлаш, республикамиз туманлари ва шахарларида ахолини тадбиркорлик фаолиятига  кенг жалб қилиш.\n\n"
                            "тадбиркорлик фаолиятига кумаклашиш сохасида тадбиркорлик бъектларига бизнесни ташкил этиш, юритиш ва янада ривожлантиришда амалий ёрдам курсатиш, давлат органлари ва бозор инфратузилмаси субъектлари хизматларидан фойдаланиш бўйича имкониятлар ва шароитлар яратиш, маслахат ёрдами ва ахборот таъминотини такдим этишда куйидагилар оркали кумаклашиш\n\n"
                            "Ўзбекистон Савдо-Саноат палатаси\n\n"
                            "Тошкент вилояти худудий бошқармаси\n"
                            "Манзил:Тошкент шахар, Яккасарой тумани\n"
                            "Ш.Руставели кўч. 22-уй ИНДЕКС 10070\n"
                            "STIR: 201 806 983   OKED 94110\n"
                            "Тел: 95 202-16-16 Юридик сектор\n"
                            "Тел:95 202-21-21 Қабул хона",reply_markup=kb.Main)
    if message.text == "🇺🇿Узб-Uzb/🇷🇺Рус-Rus":
        await message.reply("Язык изменился")
        await message.answer("Добро пожаловать в Ташкентское региональное отделение Торгово-промышленной палаты", reply_markup=kb.mainmenu2)
        

    if message.text == "✅ Виды услуг":
        await message.answer("Выбор типов услуг.", reply_markup=kb.ish2)
    if message.text == "🔙 Назад":
        await message.reply("Домашняя страница",reply_markup=kb.mainmenu2)
    if message.text == "👤 Насчет нас":
        await message.reply("Ўзбекистон Савдо-Саноат палатаси"
                            " Тошкент вилояти худудий бошқармаси.\n"
                            "Манзил:Тошкент шахар, Яккасарой тумани\n"
                            "Ш.Руставели кўч. 22-уй ИНДЕКС 10070\n"
                            "STIR: 201 806 983   OKED 94110\n"
                            "Тел: 95 202-16-16 Юридик сектор\n"
                            "Тел:95 202-21-21 Қабул хона",reply_markup=kb.Main2)
    if message.text == "🇷🇺Рус-Rus/🇺🇿Узб-Uzb":
        await message.reply("Til o`zgardi", reply_markup=kb.mainmenu)


if __name__ == '__main__':
    executor.start_polling(dp, skip_updates=True)
